{"name":"clone","type":"method","title":".clone()","deprecated":null,"removed":null,"desc":"Create a deep copy of the set of matched elements.","categories":["manipulation/copying","version/1.0","version/1.5"],"entries":[{"return":"jQuery","signatures":[{"added":"1.0","argument":{"desc":"A Boolean indicating whether event handlers should be copied along with the elements. As of jQuery 1.4, element data will be copied as well.","name":"withDataAndEvents","optional":"true","type":"Boolean","default":"false"}},{"added":"1.5","argument":[{"desc":"A Boolean indicating whether event handlers and data should be copied along with the elements. The default value is <code>false</code>. <em>*In jQuery 1.5.0 the default value was incorrectly <code>true</code>; it was changed back to <code>false</code> in 1.5.1 and up.</em>","name":"withDataAndEvents","optional":"true","type":"Boolean","default":"false"},{"desc":"A Boolean indicating whether event handlers and data for all children of the cloned element should be copied. By default its value matches the first argument's value (which defaults to <code>false</code>).","name":"deepWithDataAndEvents","optional":"true","type":"Boolean","default":"value of withDataAndEvents"}]}],"examples":{"desc":"Clones all b elements (and selects the clones) and prepends them to all paragraphs.","code":"\n$( \"b\" ).clone().prependTo( \"p\" );\n","html":"\n<b>Hello</b><p>, how are you?</p>\n"},"longdesc":"\n    <p>The <code>.clone()</code> method performs a <em>deep</em> copy of the set of matched elements, meaning that it copies the matched elements as well as all of their descendant elements and text nodes. For performance reasons, the dynamic state of form elements (e.g., user data typed into <code>input</code>, and <code>textarea</code> or user selections made to a <code>select</code>) is not copied to the cloned elements. The clone operation sets these fields to their default values as specified in the HTML.</p>\n    <p>When used in conjunction with one of the insertion methods, <code>.clone()</code> is a convenient way to duplicate elements on a page. Consider the following HTML:</p>\n    <pre><code>\n&lt;div class=\"container\"&gt;\n  &lt;div class=\"hello\"&gt;Hello&lt;/div&gt;\n  &lt;div class=\"goodbye\"&gt;Goodbye&lt;/div&gt;\n&lt;/div&gt;\n    </code></pre>\n    <p>As shown in the discussion for <code><a href=\"/append/\">.append()</a></code>,  normally when an element is inserted somewhere in the DOM, it is moved from its old location. So, given the code:</p>\n    <pre><code>\n$( \".hello\" ).appendTo( \".goodbye\" );\n    </code></pre>\n    <p>The resulting DOM structure would be:</p>\n    <pre><code>\n&lt;div class=\"container\"&gt;\n  &lt;div class=\"goodbye\"&gt;\n    Goodbye\n    &lt;div class=\"hello\"&gt;Hello&lt;/div&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n    </code></pre>\n    <p>To prevent this and instead create a copy of the element, you could write the following:</p>\n    <pre><code>\n$( \".hello\" ).clone().appendTo( \".goodbye\" );\n    </code></pre>\n    <p>This would produce:</p>\n    <pre><code>\n&lt;div class=\"container\"&gt;\n  &lt;div class=\"hello\"&gt;Hello&lt;/div&gt;\n  &lt;div class=\"goodbye\"&gt;\n    Goodbye\n    &lt;div class=\"hello\"&gt;Hello&lt;/div&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n    </code></pre>\n    <div class=\"warning\">\n      <p><strong>Note:</strong> When using the <code>.clone()</code> method, you can modify the cloned elements or their contents before (re-)inserting them into the document.</p>\n    </div>\n    <p>Normally, any event handlers bound to the original element are <em>not</em> copied to the clone. The optional <code>withDataAndEvents</code> parameter allows us to change this behavior, and to instead make copies of all of the event handlers as well, bound to the new copy of the element. As of jQuery 1.4, all element data (attached by the <code>.data()</code> method) is also copied to the new copy. </p>\n    <p>However, objects and arrays within element data are not copied and will continue to be shared between the cloned element and the original element. To deep copy all data, copy each one manually:</p>\n    <pre><code>\n// Original element with attached data\nvar $elem = $( \"#elem\" ).data( \"arr\": [ 1 ] ),\n    $clone = $elem.clone( true )\n      // Deep copy to prevent data sharing\n      .data( \"arr\", $.extend( [], $elem.data( \"arr\" ) ) );\n    </code></pre>\n    <p>As of jQuery 1.5, <code>withDataAndEvents</code> can be optionally enhanced with <code>deepWithDataAndEvents </code> to copy the events and data for all children of the cloned element.</p>\n    <div class=\"warning\">\n      <p><strong>Note:</strong> Using <code>.clone()</code> has the side-effect of producing elements with duplicate <code>id</code> attributes, which are supposed to be unique. Where possible, it is recommended to avoid cloning elements with this attribute or using <code>class</code> attributes as identifiers instead.</p>\n    </div>\n  "}]}