{"name":"jQuery.sub","type":"method","title":"jQuery.sub()","deprecated":"1.7","removed":"1.9","desc":"Creates a new copy of jQuery whose properties and methods can be modified without affecting the original jQuery object.","categories":["core","version/1.5","deprecated/deprecated-1.7","removed"],"entries":[{"return":"jQuery","signatures":{"added":"1.5"},"examples":[{"desc":"Adding a method to a jQuery sub so that it isn't exposed externally:","code":"\n(function(){\n  var sub$ = jQuery.sub();\n  sub$.fn.myCustomMethod = function() {\n    return \"just for me\";\n  };\n\n  sub$( document ).ready(function() {\n    sub$( \"body\" ).myCustomMethod() // \"just for me\"\n  });\n})();\n\ntypeof jQuery( \"body\" ).myCustomMethod // undefined\n"},{"desc":"Override some jQuery methods to provide new functionality.","code":"\n(function() {\n  var myjQuery = jQuery.sub();\n\n  myjQuery.fn.remove = function() {\n\n    // New functionality: Trigger a remove event\n    this.trigger( \"remove\" );\n\n    // Be sure to call the original jQuery remove method\n    return jQuery.fn.remove.apply( this, arguments );\n  };\n\n  myjQuery(function( $ ) {\n    $( \".menu\" ).click(function() {\n      $( this ).find( \".submenu\" ).remove();\n    });\n\n    // A new remove event is now triggered from this copy of jQuery\n    $( document ).on( \"remove\", function( event ) {\n      $( event.target ).parent().hide();\n    });\n  });\n})();\n\n// Regular jQuery doesn't trigger a remove event when removing an element\n// This functionality is only contained within the modified 'myjQuery'.\n"},{"desc":"Create a plugin that returns plugin-specific methods.","code":"\n(function() {\n\n  // Create a new copy of jQuery using sub()\n  var plugin = jQuery.sub();\n\n  // Extend that copy with the new plugin methods\n  plugin.fn.extend({\n    open: function() {\n      return this.show();\n    },\n    close: function() {\n      return this.hide();\n    }\n  });\n\n  // Add our plugin to the original jQuery\n  jQuery.fn.myplugin = function() {\n    this.addClass( \"plugin\" );\n\n    // Make sure our plugin returns our special plugin version of jQuery\n    return plugin( this );\n  };\n})();\n\n$( document ).ready(function() {\n\n  // Call the plugin, open method now exists\n  $( \"#main\" ).myplugin().open();\n\n  // Note: Calling just $( \"#main\" ).open() won't work as open doesn't exist!\n});\n"}],"longdesc":"\n    <p>\n      <strong>This method is deprecated as of jQuery 1.7 and will be moved to a plugin in jQuery 1.8.</strong>\n    </p>\n    <p>There are two specific use cases for which jQuery.sub() was created. The first was for providing a painless way of overriding jQuery methods without completely destroying the original methods and another was for helping to do encapsulation and basic namespacing for jQuery plugins.</p>\n    <p>Note that jQuery.sub() doesn't attempt to do any sort of isolation - that's not its intention. All the methods on the sub'd version of jQuery will still point to the original jQuery (events bound and triggered will still be through the main jQuery, data will be bound to elements through the main jQuery, Ajax queries and events will run through the main jQuery, etc.).</p>\n    <p>Note that if you're looking to use this for plugin development you should first <i>strongly</i> consider using something like the jQuery UI widget factory which manages both state and plugin sub-methods. <a href=\"http://blog.nemikor.com/2010/05/15/building-stateful-jquery-plugins/\">Some examples of using the jQuery UI widget factory</a> to build a plugin.</p>\n    <p>The particular use cases of this method can be best described through some examples.</p>\n  "}]}