{"name":"load","type":"method","title":".load()","deprecated":"1.8","removed":null,"desc":"Bind an event handler to the \"load\" JavaScript event.","categories":["events/document-loading","version/1.0","version/1.4.3","deprecated/deprecated-1.8"],"entries":[{"return":"jQuery","signatures":[{"added":"1.0","argument":{"desc":"A function to execute when the event is triggered.","name":"handler(eventObject)","type":"Function"}},{"added":"1.4.3","argument":[{"desc":"An object containing data that will be passed to the event handler.","name":"eventData","type":"PlainObject","optional":"true"},{"desc":"A function to execute each time the event is triggered.","name":"handler(eventObject)","type":"Function"}]}],"examples":[{"desc":"Run a function when the page is fully loaded including graphics.","code":"\n$( window ).load(function() {\n  // Run code\n});\n"},{"desc":"Add the class bigImg to all images with height greater than 100 upon each image load.","code":"\n$( \"img.userIcon\" ).load(function() {\n  if ( $( this ).height() > 100) {\n    $( this ).addClass( \"bigImg\" );\n  }\n});\n"}],"longdesc":"\n    <p>This method is a shortcut for <code>.on( \"load\", handler )</code>.</p>\n    <p>The <code>load</code> event is sent to an element when it and all sub-elements have been completely loaded. This event can be sent to any element associated with a URL: images, scripts, frames, iframes, and the <code>window</code> object.</p>\n    <p>For example, consider a page with a simple image:</p>\n    <pre><code>\n&lt;img src=\"book.png\" alt=\"Book\" id=\"book\"&gt;\n    </code></pre>\n    <p>The event handler can be bound to the image:</p>\n    <pre><code>\n$( \"#book\" ).load(function() {\n  // Handler for .load() called.\n});\n    </code></pre>\n    <p>As soon as the image has been loaded, the handler is called.</p>\n    <p>In general, it is not necessary to wait for all images to be fully loaded. If code can be executed earlier, it is usually best to place it in a handler sent to the <code>.ready()</code> method.\n    </p>\n    <div class=\"warning\">\n      <p>The Ajax module also has a method named <code><a href=\"/load/\">.load()</a></code>. Which one is fired depends on the set of arguments passed.</p>\n    </div>\n    <div class=\"warning\">\n      <p>\n        <b>Caveats of the <code>load</code> event when used with images</b>\n        <p>A common challenge developers attempt to solve using the <code>.load()</code> shortcut is to execute a function when an image (or collection of images) have completely loaded. There are several known caveats with this that should be noted. These are:</p>\n        <ul>\n          <li>It doesn't work consistently nor reliably cross-browser</li>\n          <li>It doesn't fire correctly in WebKit if the image src is set to the same src as before</li>\n          <li>It doesn't correctly bubble up the DOM tree</li>\n          <li>Can cease to fire for images that already live in the browser's cache</li>\n        </ul>\n      </p>\n    </div>\n    <div class=\"warning\">\n      <p><strong>Note:</strong> The <code>.live()</code> and <code>.delegate()</code> methods cannot be used to detect the <code>load</code> event of an iframe. The load event does not correctly bubble up the parent document and the event.target isn't set by Firefox, IE9 or Chrome, which is required to do event delegation.</p>\n    </div>\n  "}],"slug":"load-event"}