{"name":"ready","type":"method","title":".ready()","deprecated":null,"removed":null,"desc":"Specify a function to execute when the DOM is fully loaded.","categories":["events/document-loading","version/1.0"],"entries":[{"return":"jQuery","signatures":{"added":"1.0","argument":{"desc":"A function to execute after the DOM is ready.","name":"handler","type":"Function"}},"examples":{"desc":"Display a message when the DOM is loaded.","code":"\n  $( document ).ready(function() {\n    $( \"p\" ).text( \"The DOM is now loaded and can be manipulated.\" );\n  });\n","css":"\n  p {\n    color: red;\n  }\n","html":"\n<p>Not loaded yet.</p>\n"},"longdesc":"\n    <p>While JavaScript provides the <code>load</code> event for executing code when a page is rendered, this event does not get triggered until all assets such as images have been completely received. In most cases, the script can be run as soon as the DOM hierarchy has been fully constructed. The handler passed to <code>.ready()</code> is guaranteed to be executed after the DOM is ready, so this is usually the best place to attach all other event handlers and run other jQuery code.  When using scripts that rely on the value of CSS style properties, it's important to reference external stylesheets or embed style elements before referencing the scripts.</p>\n    <p>In cases where code relies on loaded assets (for example, if the dimensions of an image are required), the code should be placed in a handler for the <code>load</code> event instead.</p>\n    <div class=\"warning\">\n      <p>The <code>.ready()</code> method is generally incompatible with the <code>&lt;body onload=\"\"&gt;</code> attribute. If <code>load</code> must be used, either do not use <code>.ready()</code> or use jQuery's <code>.load()</code> method to attach <code>load</code> event handlers to the window or to more specific items, like images.\n      </p>\n    </div>\n    <p>All three of the following syntaxes are equivalent:</p>\n    <ul>\n      <li>\n        <code>$( document ).ready( handler )</code>\n      </li>\n      <li><code>$().ready( handler )</code> (this is not recommended)</li>\n      <li>\n        <code>$( handler )</code>\n      </li>\n    </ul>\n    <p>There is also <code>$(document).on( \"ready\", handler )</code>, <em>deprecated as of jQuery 1.8</em>. This behaves similarly to the ready method but if the ready event has already fired and you try to <code>.on( \"ready\" )</code> the bound handler will not be executed. Ready handlers bound this way are executed <em>after</em> any bound by the other three methods above.</p>\n    <p>The <code>.ready()</code> method can only be called on a jQuery object matching the current document, so the selector can be omitted.</p>\n    <p>The <code>.ready()</code> method is typically used with an anonymous function:</p>\n    <pre><code>\n$( document ).ready(function() {\n  // Handler for .ready() called.\n});\n    </code></pre>\n    <p>Which is equivalent to calling:</p>\n    <pre><code>\n$(function() {\n  // Handler for .ready() called.\n});\n    </code></pre>\n    <p>If <code>.ready()</code> is called after the DOM has been initialized, the new handler passed in will be executed immediately.</p>\n    <h4>Aliasing the jQuery Namespace</h4>\n    <p>When using another JavaScript library, we may wish to call <code><a href=\"/jQuery.noConflict/\">$.noConflict()</a></code> to avoid namespace difficulties. When this function is called, the <code>$</code> shortcut is no longer available, forcing us to write <code>jQuery</code> each time we would normally write <code>$</code>. However, the handler passed to the <code>.ready()</code> method can take an argument, which is passed the global <code>jQuery</code> object. This means we can rename the object within the context of our <code>.ready()</code> handler without affecting other code:</p>\n    <pre><code>\njQuery( document ).ready(function( $ ) {\n  // Code using $ as usual goes here.\n});\n    </code></pre>\n  "}]}